# Index Hierarchy

In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn

ser = Series(randn(6), index=[ [1,1,1,2,2,2], ['a','b','c','a','b','c'] ])
ser

In [3]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [4]:
ser[1]

a   -0.919149
b    0.446617
c   -0.863997
dtype: float64

In [5]:
ser[2]

a    0.780188
b   -0.318519
c    1.044163
dtype: float64

In [6]:
ser[:,'a']

1   -0.919149
2    0.780188
dtype: float64

In [7]:
dframe = ser.unstack()

In [8]:
dframe

          a         b         c
1 -0.919149  0.446617 -0.863997
2  0.780188 -0.318519  1.044163

In [10]:
dframe2 = DataFrame(np.arange(16).reshape(4,4), index=[ ['a','a','b','b'], [1,2,1,2] ],
                   columns=[['NY','NY','LA','SF'], ['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [11]:
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['Cities','Temperature']
dframe2

Cities            NY      LA   SF
Temperature     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [13]:
dframe2.swaplevel('Cities','Temperature',axis=1)

Temperature     cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [16]:
dframe2.sort_index()

Cities            NY      LA   SF
Temperature     cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [18]:
# DEPRECATED dframe2.sum(groupby='Temperature',axis=1)
dframe2.groupby(level=1).sum()

Cities        NY      LA   SF
Temperature cold hot hot cold
INDEX_2
1              8  10  12   14
2             16  18  20   22